10-1

누락된 데이터 처리하기

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from pandas import Series, DataFrame

In [4]:
string_data = pd.Series(['addrvark', 'artichoke', np.nan, 'avocado'])
string_data

0     addrvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

누락된 데이터 골라내기

In [7]:
from numpy import nan as NA

In [8]:
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [12]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [14]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  1.911177       NaN       NaN
1 -0.563248       NaN       NaN
2 -0.288034       NaN -0.875519
3  2.582663       NaN  0.265674
4 -0.240953 -0.680886 -1.320265
5 -0.515713 -2.345856 -1.415308
6 -0.200350 -0.498776  0.605807

In [16]:
df.dropna()

          0         1         2
4 -0.240953 -0.680886 -1.320265
5 -0.515713 -2.345856 -1.415308
6 -0.200350 -0.498776  0.605807

In [17]:
df.dropna(thresh=2)

          0         1         2
2 -0.288034       NaN -0.875519
3  2.582663       NaN  0.265674
4 -0.240953 -0.680886 -1.320265
5 -0.515713 -2.345856 -1.415308
6 -0.200350 -0.498776  0.605807

결측치 채우기

In [18]:
df.fillna(0)

          0         1         2
0  1.911177  0.000000  0.000000
1 -0.563248  0.000000  0.000000
2 -0.288034  0.000000 -0.875519
3  2.582663  0.000000  0.265674
4 -0.240953 -0.680886 -1.320265
5 -0.515713 -2.345856 -1.415308
6 -0.200350 -0.498776  0.605807

In [19]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  1.911177  0.500000  0.000000
1 -0.563248  0.500000  0.000000
2 -0.288034  0.500000 -0.875519
3  2.582663  0.500000  0.265674
4 -0.240953 -0.680886 -1.320265
5 -0.515713 -2.345856 -1.415308
6 -0.200350 -0.498776  0.605807

In [20]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0  1.911177  0.000000  0.000000
1 -0.563248  0.000000  0.000000
2 -0.288034  0.000000 -0.875519
3  2.582663  0.000000  0.265674
4 -0.240953 -0.680886 -1.320265
5 -0.515713 -2.345856 -1.415308
6 -0.200350 -0.498776  0.605807

In [21]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.364850  0.125222 -0.258309
1  1.095846  0.128280 -0.916510
2  0.647548       NaN  0.303962
3 -1.510271       NaN  0.236928
4  0.563911       NaN       NaN
5  0.878068       NaN       NaN

In [22]:
df.fillna(method='ffill')

          0         1         2
0 -0.364850  0.125222 -0.258309
1  1.095846  0.128280 -0.916510
2  0.647548  0.128280  0.303962
3 -1.510271  0.128280  0.236928
4  0.563911  0.128280  0.236928
5  0.878068  0.128280  0.236928

In [23]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.364850  0.125222 -0.258309
1  1.095846  0.128280 -0.916510
2  0.647548  0.128280  0.303962
3 -1.510271  0.128280  0.236928
4  0.563911       NaN  0.236928
5  0.878068       NaN  0.236928

In [24]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

10-2

중복 제거하기

In [25]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [26]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [27]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [28]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [29]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

함수나 매핑을 이용해서 데이터 변형하기

In [30]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [31]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [32]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [33]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [34]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

값 치환하기

In [35]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [36]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [37]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [38]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [39]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

축 색인 이름 바꾸기

In [40]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [41]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [42]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [43]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [44]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [45]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

개별화와 양자화

In [46]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [47]:
bins = [18, 25, 35, 60, 100]

In [48]:
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [49]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [50]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [51]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [52]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [53]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [54]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.77, 0.99], (0.32, 0.54], (0.54, 0.77], (0.77, 0.99], (0.32, 0.54], ..., (0.77, 0.99], (0.094, 0.32], (0.77, 0.99], (0.32, 0.54], (0.32, 0.54]]
Length: 20
Categories (4, interval[float64]): [(0.094, 0.32] < (0.32, 0.54] < (0.54, 0.77] < (0.77, 0.99]]

In [55]:
data = np.random.randn(1000)  # 정규 분포
cats = pd.qcut(data, 4)       # 4분위로 분류
cats

[(0.0367, 0.682], (-2.764, -0.691], (0.682, 3.091], (0.682, 3.091], (0.682, 3.091], ..., (0.0367, 0.682], (0.0367, 0.682], (-0.691, 0.0367], (-2.764, -0.691], (-2.764, -0.691]]
Length: 1000
Categories (4, interval[float64]): [(-2.764, -0.691] < (-0.691, 0.0367] < (0.0367, 0.682] < (0.682, 3.091]]

In [56]:
pd.value_counts(cats)

(0.682, 3.091]      250
(0.0367, 0.682]     250
(-0.691, 0.0367]    250
(-2.764, -0.691]    250
dtype: int64

In [57]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(0.0367, 1.262], (-1.331, 0.0367], (0.0367, 1.262], (1.262, 3.091], (1.262, 3.091], ..., (0.0367, 1.262], (0.0367, 1.262], (-1.331, 0.0367], (-2.764, -1.331], (-1.331, 0.0367]]
Length: 1000
Categories (4, interval[float64]): [(-2.764, -1.331] < (-1.331, 0.0367] < (0.0367, 1.262] < (1.262, 3.091]]

10-3

문자열 객체 메서드

In [58]:
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [59]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [60]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [61]:
'::'.join(pieces)

'a::b::guido'

In [62]:
'guido' in val

True

In [63]:
val.index(',')

1

In [64]:
val.find(':')

-1

In [65]:
val.index(':')

ValueError: substring not found

In [66]:
val.count(',')

2

In [67]:
val.replace(',', '::')

'a::b:: guido'

In [69]:
val.replace(',', '')

'ab guido'

정규 표현식

In [70]:
import re
text = "foo bar\t baz \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [71]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [72]:
regex.findall(text)

[' ', '\t ', ' \t']

In [75]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
# re.IGNORECASE는 정규 표현식이 대소문자를 가리지 않도록 한다.
regex = re.compile(pattern, flags=re.IGNORECASE)

In [76]:
m = regex.search(text)
m

In [77]:
text[m.start():m.end()]

'dave@google.com'

In [78]:
print(regex.match(text))

None

In [79]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [80]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [81]:
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [82]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [83]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

pandas의 벡터화된 문자열 함수

In [84]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [85]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [86]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [87]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [88]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [89]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [90]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [91]:
matches.str[0]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [92]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object